Public Attributes | List of all members
API_LayoutBook Struct Reference
Project Navigator
Represents the Book settings. More...
#include <APIdefs_Database.h>
 Public Attributes
bool  | flatNumbering
Use flat Layout order or hierarchy (Tree view by Subset).
GS::UniString  | prefix
ID Prefix.
API_NumberingStyle  | numberingStyle
ID appearance style.
Int32  | startAt
Start numbering at.
bool  | useChangeOwnID
Use change ID or Number by Revisions.
GS::UniString  | changePrefix
ID prefix in Revisions.
API_NumberingStyle  | changeNumberingStyle
ID appearance style in Revisions.
GS::HashTable< API_Guid, GS::UniString >  | customScheme
Contains the custom data fields. The custom scheme GUID-value pairs are stored in a GS::HashTable.
Detailed Description
Represents the Book settings.
Remarks
You can get Book Settings via ACAPI_Navigator_GetLayoutBook function.
Member Data Documentation
◆ changeNumberingStyle
 API_LayoutBook::changeNumberingStyle
ID appearance style in Revisions.
◆ changePrefix
 API_LayoutBook::changePrefix
ID prefix in Revisions.
◆ customScheme
 API_LayoutBook::customScheme
Contains the custom data fields. The custom scheme GUID-value pairs are stored in a GS::HashTable.
◆ flatNumbering
 API_LayoutBook::flatNumbering
Use flat Layout order or hierarchy (Tree view by Subset).
◆ numberingStyle
 API_LayoutBook::numberingStyle
ID appearance style.
◆ prefix
 API_LayoutBook::prefix
ID Prefix.
◆ startAt
 API_LayoutBook::startAt
Start numbering at.
◆ useChangeOwnID
 API_LayoutBook::useChangeOwnID
Use change ID or Number by Revisions.